#pragma once
#include "binary_tree.h"
/************************************************************************/
/* 把二叉树转换为排好序的双端链表，因为二叉树本身就是排好序的，所以需要转换后的链表也排好序
/************************************************************************/

/************************************************************************/
/* 把二叉树转换为双端链表
/************************************************************************/
BinaryTree* convert_tree_to_double_list(BinaryTree* header);

void convert_tree_internal(BinaryTree* node, BinaryTree** last_node);

void convert_tree_print(BinaryTree* node);

void convert_tree_empty_list(BinaryTree* header);

/************************************************************************/
/* 开始算法
/************************************************************************/
void start_convert_binary_tree_to_list();