#pragma once
#include "common.h"
#include "utils.h"

/************************************************************************/
/* 著名的八皇后问题：
/* 有8个皇后，把她们放在8*8的方格里面，要求：
/* 1 任意两个不能再同行或者同列
/* 2 任意两个不能再一条斜线上面
/* 求问，有多少种摆法
/************************************************************************/

#define QUEEN_SUM 8

/************************************************************************/
/* 解法1：采取全排列的方式解决queen的问题
/************************************************************************/
void solve_eight_queen();

void solve_eight_queen_internal(int queen_map[QUEEN_SUM], int index, int& sum);

/************************************************************************/
/* 检查当前的排列是否满足条件
/************************************************************************/
bool check_queen(int queen_map[QUEEN_SUM]);

/************************************************************************/
/* 解法2：通过回朔法的方式解决queen的问题
/************************************************************************/
void solve_eight_queen_backwards();

void eight_queen_backwards_internal(int queen_map[QUEEN_SUM], int pos, int& sum);

bool check_queen_backwards(int queen_map[QUEEN_SUM], int pos);



/************************************************************************/
/* 开始算法
/************************************************************************/
void start_eight_queen();