#pragma once
#include "common.h"

/************************************************************************/
/* 一个数组中，除了两个数字之外，其他均出现了两次，请查找出这两个数字，要求：时间复杂度为O(n)，
/* 空间复杂度为O(1)
/************************************************************************/

void find_1_times_num_in_arr(int* arr, int size, int numbers[2]);

int find_first_1_index(int result);


/************************************************************************/
/* 开始算法
/************************************************************************/
void start_find_1_times_num();